basic_model/sentinel_model_basic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;

xl -0.3;
xu 0.3;
yl -0.3;
yu 0.4;
zl -0.45;
zu 0.3;

vertices
(
    ( $xl  $yl  $zl)
    ($xu  $yl  $zl)
    ($xu  $yu  $zl)
    ( $xl  $yu  $zl)
    ( $xl  $yl  $zu)
    ($xu  $yl  $zu)
    ($xu  $yu  $zu)
    ( $xl  $yu  $zu)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (30 35 38) 
    hex (0 1 2 3 4 5 6 7) (40 47 50) 
    simpleGrading 
    (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }
    
    right
    {
        type symmetry;
        faces
        (
            (2 6 5 1)
        );
    }
    
    up
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
    
    down
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
