basic_model/sentinel_model_basic/system/fvSchemes.mppic
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    //default         Gauss linear;
    default         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(alphaPhi.air,U.air) Gauss linearUpwindV unlimited;
    div(((alpha.air*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;
    div(phiGByA,kinematicCloud:alpha) Gauss linear;
    div(alphaPhi.air,epsilon.air) bounded Gauss linearUpwind limited;
    div(alphaPhi.air,k.air) bounded Gauss linearUpwind limited;
    //div(alphaPhi.air,epsilon.air) Gauss limitedLinear 1;
    //div(alphaPhi.air,k.air) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
